 # У Кабана 150 рублей на кармане и три брата не по крови, а по духу.
 # Какую максимальную сумму денег Кабан может отдать за баночку пева, чтобы угостить всех своих братьев?

brothers = 3
money = 50

money = input("Введите стоимость баночки: ")
money = int(money)

if (money == 50):
    print("Хватит на двоих, один в пролёте")

if (money <= 50):
    print("Гуляй рванина! Хватит, чтобы угостить всех")

if (money >= 50):
    print(("Придётся кому-то без пивка("))









